test_cases/3d_water/3d_flashingHotWaterNozzle/2_hotWater_rampOut_lowRes_kEps+SY/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 	HRMFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         10.0E-3;

deltaT          5e-7;

maxDeltaT	1e-5;

writeControl    adjustableRunTime;
writeInterval   5.0e-5;

//writeControl    timeStep;
//writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression on;

timeFormat      general;

adjustTimeStep  yes;

maxCo           1.2;

timePrecision   6;

runTimeModifiable yes;

/*  if we need to do writing of a field that is not normally output
functions
{
    testing
    {
        type writeRegisteredObject;
        functionObjectLibs ( "libIOFunctionObjects.so" );
        objectNames ("bananas");
        outputControl     outputTime;
    }
}
*/
// ************************************************************************* //
