test_cases/3d_water/3d_flashingHotWaterNozzle/2_hotWater_rampOut_lowRes_kEps+SY/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMesh dynamicMotionSolverFvMesh;
//dynamicFvMesh  subsetMotionSolverFvMesh;

twoDMotion      yes;

//dynamicFvMesh  dynamicMotionSolverFvMesh;

dynamicFvMesh  staticFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

//solver laplacian;
//solver velocityComponentLaplacian x;

solver   laplaceFaceDecomposition;

diffusivity     quadratic;

frozenDiffusion off;

distancePatches
(
);


// ************************************************************************* //
