test_cases/3d_water/3d_flashingHotWaterNozzle/2_hotWater_rampOut_lowRes_kEps+SY/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  
p
{
    solver          PBiCGStab;  // for large problems, use GAMG
    smoother        symGaussSeidel;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
    minIter         1;
}


U
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
}


h
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}


rho
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
    minIter         1;	
}


x
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
    minIter         1;	
}


y
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;
    minIter         1;
}


epsilon
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
    minIter         1;	
}


k
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-06;
    relTol          0;
    minIter         1;	
}

Omega
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-5; //1e-06; // allow larger residuals during startup.
    relTol          0;
}

	
}

PISO
{

    nCorrectors     15;
    NRepsilon	    0.5e-04;
    nNonOrthogonalCorrectors  0;
	
}

 relaxationFactors
{
      p               0.2;
      U               0.2;
      pFlux           0.2;
      k   0.15;
      epsilon  0.15;
      Omega 0.25;
}



// ************************************************************************* //

